In [1]:
import os
import pandas as pd

In [4]:
menu = pd.read_excel("Menu and Orders.xlsx",sheet_name='MENU')

In [186]:
menu.head()

,Pizza,Pizza Price,Pizza ID,Pasta,Pasta Price,Pasta ID,House Plates,House Plates Prices,House Plates ID
0,Margherita,10,10101,Top Truffle Tagliatelle,14.0,20101.0,house fried chicken,11.0,30113.0
1,Vegan Viking,13,10102,Rock Star Rigatoni,15.0,20102.0,vegan fried chicken,11.0,30112.0
2,green god,12,10103,Slow Beef Rigatoni,14.0,20103.0,feta &watermelon salad,12.0,30111.0
3,rock star margherita,13,10104,Spicy Ragu Tagliatelle,12.0,20104.0,fried chicken salad,12.0,30110.0
4,samson,14,10105,Beetroot Gnocchi (Vegan),13.0,20105.0,NaN,NaN,NaN

In [187]:
menu.columns

Index(['Pizza', 'Pizza Price ', 'Pizza ID', 'Pasta', 'Pasta Price', 'Pasta ID',
       'House Plates', 'House Plates Prices', 'House Plates ID'],
      dtype='object')

In [188]:
pizza = menu[['Pizza', 'Pizza Price ', 'Pizza ID']].copy()
pizza['foodtype'] = 'Pizza'
pizza.head()

                  Pizza  Pizza Price   Pizza ID foodtype
0            Margherita            10     10101    Pizza
1          Vegan Viking            13     10102    Pizza
2             green god            12     10103    Pizza
3  rock star margherita            13     10104    Pizza
4                samson            14     10105    Pizza

In [189]:
pasta = menu[[ 'Pasta', 'Pasta Price', 'Pasta ID']].copy()
pasta['foodtype'] = 'Pasta'
pasta.head()

                      Pasta  Pasta Price  Pasta ID foodtype
0   Top Truffle Tagliatelle         14.0   20101.0    Pasta
1        Rock Star Rigatoni         15.0   20102.0    Pasta
2        Slow Beef Rigatoni         14.0   20103.0    Pasta
3    Spicy Ragu Tagliatelle         12.0   20104.0    Pasta
4  Beetroot Gnocchi (Vegan)         13.0   20105.0    Pasta

In [190]:
house = menu[[ 'House Plates', 'House Plates Prices', 'House Plates ID']].copy()
house['foodtype'] = 'House Plate'
house.head()

             House Plates  House Plates Prices  House Plates ID     foodtype
0     house fried chicken                 11.0          30113.0  House Plate
1     vegan fried chicken                 11.0          30112.0  House Plate
2  feta &watermelon salad                 12.0          30111.0  House Plate
3     fried chicken salad                 12.0          30110.0  House Plate
4                     NaN                  NaN              NaN  House Plate

In [191]:
clmnames = ['item','prices','id','foodtype']

In [192]:
for df in [pizza,pasta,house]:
    df.columns = clmnames

In [193]:
pasta.head()

                       item  prices       id foodtype
0   Top Truffle Tagliatelle    14.0  20101.0    Pasta
1        Rock Star Rigatoni    15.0  20102.0    Pasta
2        Slow Beef Rigatoni    14.0  20103.0    Pasta
3    Spicy Ragu Tagliatelle    12.0  20104.0    Pasta
4  Beetroot Gnocchi (Vegan)    13.0  20105.0    Pasta

In [194]:
comb_menu = pizza.append([pasta,house]).reset_index(drop=True)

In [195]:
comb_menu.dropna(inplace=True)

In [196]:
comb_menu.head()

                   item  prices       id foodtype
0            Margherita    10.0  10101.0    Pizza
1          Vegan Viking    13.0  10102.0    Pizza
2             green god    12.0  10103.0    Pizza
3  rock star margherita    13.0  10104.0    Pizza
4                samson    14.0  10105.0    Pizza

In [197]:
orders = pd.read_excel("Menu and Orders.xlsx",sheet_name='Order')

In [198]:
orders.head()

        Customer Name Order Date                    Order
0  Sallyanne Antonsen 2020-02-23        10101-30111-20104
1     Mordecai Lehrle 2021-02-10  20105-30112-10109-30111
2          Bee Masser 2020-12-23              20103-10103
3    Casey Ballintyne 2020-04-20                    10107
4     Hadrian Rizzolo 2020-12-30              20102-20104

In [199]:
orders.columns = [x.strip().replace(' ','_').lower() for x in orders.columns]

In [200]:
orders[['0','1','2','3']] = orders['order'].apply(lambda x:pd.Series(str(x).split('-')))

In [153]:
orders = orders.drop(labels='order',axis=1)

In [202]:
orders=orders.melt(id_vars=['customer_name', 'order_date'], value_vars=['0','1','2','3']).dropna()

In [203]:
orders=orders.drop('variable',axis=1)

In [204]:
orders = orders.rename(columns={'value':'id'})

In [215]:
comb_menu['id']= comb_menu['id'].astype(int)
comb_menu['id']= comb_menu['id'].astype(str)

In [219]:
orders = orders.merge(comb_menu,on='id')

In [224]:
import datetime as dt

In [238]:
orders['dow'] = orders['order_date'].apply(lambda x:dt.date.strftime(x,'%A'))

In [279]:
df['hasimage'] = np.where(df['photos']!= '[]', True, False)

In [286]:
import numpy as np

In [296]:
orders['pricewithdiscount'] = np.where(orders['dow']== 'Monday', orders['prices']/2, orders['prices'])

# output1
### we want to calculate the total money for each day of the week

In [307]:
orders.groupby(by='dow').sum()[['pricewithdiscount']]

           pricewithdiscount
dow
Friday                  98.0
Monday                  45.0
Saturday               137.0
Sunday                  97.0
Thursday                63.0
Tuesday                154.0
Wednesday              213.0

# output2
### Customer with most orders

In [338]:
orders['customer_name'].value_counts().head(1)

Mordecai Lehrle    4
Name: customer_name, dtype: int64